lvgl/lv_port_stm32f429_disco/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Ac6
  * @version V1.0
  * @date    01-December-2013
  * @brief   Default main function.
  ******************************************************************************
*/


#include "stm32f4xx.h"
#include "hal_stm_lvgl/stm32f429i_discovery.h"

#include "lvgl/lvgl.h"

#include "hal_stm_lvgl/tft/tft.h"
#include "hal_stm_lvgl/touchpad/touchpad.h"

#include "lv_examples/lv_apps/demo/demo.h"
#include "lv_examples/lv_apps/benchmark/benchmark.h"

static void SystemClock_Config(void);


const char * huge_str =
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
