lvgl/lv_port_stm32f429_disco/src/main.c
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough."
		"A very long line with not less than 100 characters in it, it's very very long and still not enough.";

int main(void)
{
	HAL_Init();

	/* Configure the system clock to 180 MHz */
	SystemClock_Config();

	/*Start up indication*/
	BSP_LED_Init(LED3);
	uint8_t i;
	for (i = 0; i < 8; i++) {
		BSP_LED_Toggle(LED3);
		HAL_Delay(50);
	}

	lv_init();

	tft_init();
	touchpad_init();

